In [1]:

#Pandas

In [2]:
import pandas
pandas.__version__

'1.0.1'

In [3]:
import numpy as np
import pandas as pd

In [4]:

#Series

In [5]:
counts = pd.Series([632, 1638, 569, 115])
counts

0     632
1    1638
2     569
3     115
dtype: int64

In [6]:
counts.values

array([ 632, 1638,  569,  115], dtype=int64)

In [7]:
counts.index

RangeIndex(start=0, stop=4, step=1)

In [8]:
bacteria = pd.Series([632, 1638, 569, 115],
                    index=['Firmicutes', 'Proteobacteria', 'Actinobacteria', 'Bacteriodetes'])
bacteria

Firmicutes         632
Proteobacteria    1638
Actinobacteria     569
Bacteriodetes      115
dtype: int64

In [9]:
bacteria['Actinobacteria']

569

In [10]:
bacteria[0]

632

In [11]:
bacteria.name = 'counts'
bacteria.index.name = 'phylum'
bacteria

phylum
Firmicutes         632
Proteobacteria    1638
Actinobacteria     569
Bacteriodetes      115
Name: counts, dtype: int64

In [12]:
np.log(bacteria)

phylum
Firmicutes        6.448889
Proteobacteria    7.401231
Actinobacteria    6.343880
Bacteriodetes     4.744932
Name: counts, dtype: float64

In [13]:
bacteria[bacteria>1000]

phylum
Proteobacteria    1638
Name: counts, dtype: int64

In [14]:
bacteria_dict = {'Firmicutes':632, 'Proteobacteria':1500, 'Actinobacteria':569, 'Bacteriodetes':115}
print(bacteria_dict)
pd.Series(bacteria_dict)

{'Firmicutes': 632, 'Proteobacteria': 1500, 'Actinobacteria': 569, 'Bacteriodetes': 115}

Firmicutes         632
Proteobacteria    1500
Actinobacteria     569
Bacteriodetes      115
dtype: int64

In [15]:

#DataFrame

In [17]:
data = {"Province":["FL","FL","NH","NH","ZH"],
       "Year":[2013, 2014, 2013, 2014, 2014],
       "Literacy":[0.2, 0.1, 0.5, 0.3, 0.5]}
print(data)
data = pd.DataFrame(data)
data

{'Province': ['FL', 'FL', 'NH', 'NH', 'ZH'], 'Year': [2013, 2014, 2013, 2014, 2014], 'Literacy': [0.2, 0.1, 0.5, 0.3, 0.5]}

  Province  Year  Literacy
0       FL  2013       0.2
1       FL  2014       0.1
2       NH  2013       0.5
3       NH  2014       0.3
4       ZH  2014       0.5

In [18]:
df = pd.DataFrame(data, columns=["Year", "Province" ,"Literacy"])
df

   Year Province  Literacy
0  2013       FL       0.2
1  2014       FL       0.1
2  2013       NH       0.5
3  2014       NH       0.3
4  2014       ZH       0.5

In [19]:
df['nonsense'] = df.Year / df.Literacy
df

   Year Province  Literacy      nonsense
0  2013       FL       0.2  10065.000000
1  2014       FL       0.1  20140.000000
2  2013       NH       0.5   4026.000000
3  2014       NH       0.3   6713.333333
4  2014       ZH       0.5   4028.000000

In [20]:
df['Serie_aligned'] = pd.Series(range(5), index=[0,1,2, 3, 4])
df

   Year Province  Literacy      nonsense  Serie_aligned
0  2013       FL       0.2  10065.000000              0
1  2014       FL       0.1  20140.000000              1
2  2013       NH       0.5   4026.000000              2
3  2014       NH       0.3   6713.333333              3
4  2014       ZH       0.5   4028.000000              4

In [21]:
df.to_dict()

{'Year': {0: 2013, 1: 2014, 2: 2013, 3: 2014, 4: 2014},
 'Province': {0: 'FL', 1: 'FL', 2: 'NH', 3: 'NH', 4: 'ZH'},
 'Literacy': {0: 0.2, 1: 0.1, 2: 0.5, 3: 0.3, 4: 0.5},
 'nonsense': {0: 10065.0,
  1: 20140.0,
  2: 4026.0,
  3: 6713.333333333334,
  4: 4028.0},
 'Serie_aligned': {0: 0, 1: 1, 2: 2, 3: 3, 4: 4}}

In [22]:
pd.DataFrame(df.to_dict())

   Year Province  Literacy      nonsense  Serie_aligned
0  2013       FL       0.2  10065.000000              0
1  2014       FL       0.1  20140.000000              1
2  2013       NH       0.5   4026.000000              2
3  2014       NH       0.3   6713.333333              3
4  2014       ZH       0.5   4028.000000              4

In [23]:
data = [{'a': i, 'b':10* i}for i in range(6)]
print(data)
pd.DataFrame(data)

[{'a': 0, 'b': 0}, {'a': 1, 'b': 10}, {'a': 2, 'b': 20}, {'a': 3, 'b': 30}, {'a': 4, 'b': 40}, {'a': 5, 'b': 50}]

   a   b
0  0   0
1  1  10
2  2  20
3  3  30
4  4  40
5  5  50

In [24]:
pd.DataFrame([{'aa': 1, 'bb': 2}, {'bb': 3, 'cc': 6}])

    aa  bb   cc
0  1.0   2  NaN
1  NaN   3  6.0

In [25]:
pd.DataFrame(np.random.randint(2, 12),
             columns=['foo', 'bar'],
             index=['a', 'b', 'c'])

   foo  bar
a   10   10
b   10   10
c   10   10